In [17]:
import pandas as pd
import numpy as np

In [18]:
dict = {
    'Dat1':[1,2,3,np.nan],
    'Dat2':[4,np.nan,6,9],
    'Dat5':[7,8,9,9],

}

In [19]:
df = pd.DataFrame(dict, index = ['d1', 'd2', 'd3', 'd4'])
df

    Dat1  Dat2  Dat5
d1   1.0   4.0     7
d2   2.0   NaN     8
d3   3.0   6.0     9
d4   NaN   9.0     9

In [20]:
df.isnull()*1

    Dat1  Dat2  Dat5
d1     0     0     0
d2     0     1     0
d3     0     0     0
d4     1     0     0

In [21]:
df.isnull()

     Dat1   Dat2   Dat5
d1  False  False  False
d2  False   True  False
d3  False  False  False
d4   True  False  False

In [22]:
df.fillna('Perdido')

       Dat1     Dat2  Dat5
d1      1.0      4.0     7
d2      2.0  Perdido     8
d3      3.0      6.0     9
d4  Perdido      9.0     9

In [23]:
df.fillna(df.mean())

    Dat1      Dat2  Dat5
d1   1.0  4.000000     7
d2   2.0  6.333333     8
d3   3.0  6.000000     9
d4   2.0  9.000000     9

In [29]:
dict = {
    'Dat1':[1,2,3,np.nan],
    'Dat2':[4,np.nan,6,9],
    'Dat5':[7,8,9,9],
    'Dat4':['a', 'b', None, 'd']
}
df = pd.DataFrame(dict)
df.interpolate()

   Dat1  Dat2  Dat5  Dat4
0   1.0   4.0     7     a
1   2.0   5.0     8     b
2   3.0   6.0     9  None
3   3.0   9.0     9     d

In [30]:
df.dropna()

   Dat1  Dat2  Dat5 Dat4
0   1.0   4.0     7    a